## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.grafana.azurerm_role_assignment.grafana_admin must be replaced
-/+ resource "azurerm_role_assignment" "grafana_admin" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/61062400-6438-46d6-8bef-81f3a78fc9b4/resourceGroups/huggingface-dev/providers/Microsoft.Dashboard/grafana/grafana-dev/providers/Microsoft.Authorization/roleAssignments/54bcd340-efbf-9165-3aaf-d6dafb9002d7" -> (known after apply)
      ~ name                                   = "54bcd340-efbf-9165-3aaf-d6dafb9002d7" -> (known after apply)
      ~ principal_id                           = "be15d227-89e5-4392-9aa5-6a779ae8b617" -> "f1640552-081b-47d6-bd1d-b4ffa43b4c9e" # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/61062400-6438-46d6-8bef-81f3a78fc9b4/providers/Microsoft.Authorization/roleDefinitions/22926164-76b3-42b3-bc55-97df8dab3e41" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```
</details>